src/runtime/web/scene12.org
#+TITLE:Merge sort experiment Scene-12
#+AUTHOR: VLEAD
#+DATE: [2017-12-18 MON]
#+SETUPFILE: ../../org-templates/level-2.org
#+TAGS: boilerplate(b)
#+EXCLUDE_TAGS: boilerplate
#+OPTIONS: ^:nil'

* Introduction

- This page prompts the user to enter an array and calculates the time complexity for that using mergesort graph.
- Two ways of computation is done.
  - The formula based computation.
  - Computation using the mergesort graph.
- After completing the two ways of computation we compare both the values and prove that they are the same.

* Code and narration
** Index HTML
