build/docs/runtime/web/scene12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Merge sort experiment Scene-12</title>
<!-- 2019-04-09 Tue 14:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../../style/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../style/css/bootstrap.mini.css"/>
<link rel="stylesheet" type="text/css" href="../../style/css/labtheme.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Merge sort experiment Scene-12</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>This page prompts the user to enter an array and calculates the time complexity for that using mergesort graph.
</li>
<li>Two ways of computation is done.
<ul class="org-ul">
<li>The formula based computation.
</li>
<li>Computation using the mergesort graph.
</li>
</ul>
</li>
<li>After completing the two ways of computation we compare both the values and prove that they are the same.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Code and narration</h2>
