src/runtime/web/scene12.org
*** HTML for the experiment

#+BEGIN_SRC  html :tangle templates/scene12.html :eval no :noweb yes
<!DOCTYPE html>
<html lang="en">

  <head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">

    <meta name="description" content="">
    <meta name="author" content="">
    <title>Merge Sort</title>
    <script src="{{ url_for('static', filename='default/js/d3.v3.min.js')}}"></script>
    <script src="{{ url_for('static', filename='default/js/dagre-d3.js')}}"></script>

    <!-- Bootstrap core CSS -->
    <link href="{{ url_for('static', filename='default/css/bootstrap.min.css')}}" rel="stylesheet">

    <!-- Plugin CSS -->
    <link href="{{ url_for('static', filename='default/css/dataTables.bootstrap4.css')}}" rel="stylesheet">
    <script src="{{ url_for('static', filename='default/js/jquery.min.js')}}"></script>

    <!-- Custom styles for this template -->
    <link href="{{ url_for('static', filename='default/css/sb-admin.css')}}" rel="stylesheet">
    <style id="css">
      /* This sets the color for "TK" nodes to a light blue green. */
      g.type-TK > rect {
        fill: #00ffd0;
      }
      h6 {
        font-size: 18px;
      }
      .hidden {
        display: none;
      }
      text {
        font-weight: 300;
        font-family: "Helvetica Neue", Helvetica, Arial, sans-serf;
        font-size: 14px;
      }
      i {
          border: solid black;
          border-width: 0 3px 3px 0;
          display: inline-block;
          padding: 3px;
      }
      .left {
        transform: rotate(135deg);
        -webkit-transform: rotate(135deg);
      }
      .down {
        transform: rotate(45deg);
        -webkit-transform: rotate(45deg);
        float:right;
      }
      input {
      display: inline-block;
      vertical-align: middle;
      margin: 10px 0;
      }
      #but1 {
      display: inline-block;
      vertical-align: middle;
      }
      #c{
      display: inline-block;
      margin-left: 400px;
      }
      #but2 {
      display: inline-block;
      vertical-align: middle;
      }

      .node rect {
        stroke: #999;
        fill: #fff;
        stroke-width: 1.5px;
      }

      .edgePath path {
        stroke: #333;
        stroke-width: 1.5px;
      }
      /*tspan{
        fill: red;
        font-weight: bold
      }*/
      div{
        z-index:1;
      }
      div.bond
      {
        position: -webkit-sticky; /* Safari */
        position: sticky;
        z-index:3;
        top: -10px;
        background-color: #C8C8C8;
      }
      .bl{
        background-color: lightblue;
      }
    </style>
  </head>

  <body class="fixed-nav sticky-footer bg-dark" id="page-top">

    <!-- Navigation -->
    <nav class="navbar navbar-expand-lg navbar-dark bg-dark fixed-top" id="mainNav">
      <a class="navbar-brand" href="#">DS-Lab</a>
      <button style="background-color:#bfc9ca;margin-left:31px" class="btn btn-success" onclick="pane()">Pane</button>
      <button class="navbar-toggler navbar-toggler-right" type="button" data-toggle="collapse" data-target="#navbarResponsive" aria-controls="navbarResponsive" aria-expanded="false" aria-label="Toggle navigation">
        <span class="navbar-toggler-icon"></span>
      </button>
      <div class="collapse navbar-collapse" id="navbarResponsive">
        <ul class="navbar-nav navbar-sidenav" id="exampleAccordion">
          <li class="nav-item active" data-toggle="tooltip" data-placement="right" title="Dashboard">
            <a class="nav-link" href="#">
              <span class="nav-link-text">
                Merge-Sort
              </span>
            </a>
          </li>
          <li class="nav-item" data-toggle="tooltip" data-placement="right" title="References">
            <a class="nav-link nav-link-collapse collapsed" data-toggle="collapse" href="#collapseComponents" data-parent="#exampleAccordion">
              <span class="nav-link-text">
                References
              </span>
              <i class="down"></i>
            </a>
            <ul class="sidenav-second-level collapse" id="collapseComponents">
              <li>
                <a href="https://en.wikipedia.org/wiki/Merge_sort">Wiki-pedia</a>
              </li>
              <li>
                <a href="http://www.geeksforgeeks.org/merge-sort/">Geeks for Geeks</a>
              </li>
            </ul>
          </li>
          <li class="nav-item" data-toggle="tooltip" data-placement="right" title="Example Pages">
            <a class="nav-link nav-link-collapse collapsed" data-toggle="collapse" href="#collapseExamplePages" data-parent="#exampleAccordion">
            <span class="nav-link-text">
                Quizzes
            </span>
            <i class="down"></i>
            </a>
            <ul class="sidenav-second-level collapse" id="collapseExamplePages">
              <li>
                <a href="#">Quiz-1</a>
              </li>
              <li>
                <a href="#">Quiz-2</a>
              </li>
            </ul>
          </li>
        </ul>
        <ul class="navbar-nav sidenav-toggler">
          <li class="nav-item">
            <a class="nav-link text-center" id="sidenavToggler">
              <i class="left"></i>
            </a>
          </li>
        </ul>
        <ul class="navbar-nav ml-auto">
          <ul class="readcrumb">
            <li >
              <a href="#">VLEADS</a>
            </li>
            <li>
              <a href="#">DS -> Merge-Sort</a>
            </li>
          </ul>
          <li class="nav-item">
            <a class="nav-link" data-toggle="modal" data-target="#exampleModal">
              Logout
            </a>
          </li>
        </ul>
      </div>
    </nav>

    <div class="content-wrapper">
      <div class="bond">
        <div class="form-group">
          <label for="arr" style="font-size:130%">Please enter the array to sort (space separated)</label>
          <input type="text" id="arr" class="form-control" style="width:55%;font-size: 120%" >
          <button type="button" id="but1" style="display:inline;position:absolute;left:2%;background-color:#606060;" class="btn btn-success btn-lg" onclick="helper()">Sort</button>
          <h3 id="c">Merge Sort Time Complexity Example</h3>
          <a href='/11' class="btn btn-success btn-lg" style="display:inline;position:absolute;left:83%;background-color:#606060;"><< Back</a>
          <a href='/13' class="btn btn-success btn-lg" style="display:inline;position:absolute;left:92%;background-color:#606060;">Next >></a>
          <button type="button" id="but2" style="display:inline;position:absolute;left:75%;background-color:#606060;" class="btn btn-success btn-lg" onclick="reset1()">Reset</button>
          <br/><br/>
        </div>
      </div>
    <!-- <div class="list-group" style="width:40%">
      <a href="#" class="list-group-item list-group-item-action  list-group-item-info">
        <p>
           Click on the node to split the node into two halves.<br/>
           Repeat the process to see the recursive structure.
        </p>
      </a>
    </div> -->
    <br/><br/>
      <div class="container-fluid" style="position: relative">
        <div id="svg-holder">
        </div>
        <div class="card mb-3">
          <svg id="svg-canvas" width=100% height=600 style="position: absolute;left:700px;top:50px;"></svg>
        </div>
        <div class="list-group" style="width:40%">
          <a href="#" class="list-group-item list-group-item-action list-group-item-success">
            <h5 style="color:black;font-weight: bold">MergeSort Time Complexity Example</h5>
            <ul style="color:black">
              <li><h6>Enter an array of max size 10 elements containing only single digits.</h6></li>
              <li><h6>The array entered will be sorted and mergesort graph will be displayed.</h6></li>
              <li><h6>We will manually compute the number of splits and time for merging the arrays and compare with mergesort time complexity formula. </h6></li>
            </ul>
          </a>
        </div><br/><br/>
        <div style="width:40%" class="list-group answer-holder">
          <a href="#" class="list-group-item list-group-item-action list-group-item-success">
            <h5 style="color:black;font-weight: bold">Computation</h5>
            <ul style="color:black" id="computation-holder">
            </ul>
          </a>
        </div>
        <script src="../static/js/mergesort_example.js"></script>
      </div>
      <br/><br/><br/>
    </div>

    <!-- /.container-fluid -->
    <!-- /.content-wrapper -->
    <!-- Scroll to Top Button -->

    <a class="scroll-to-top rounded" href="#page-top">
      <i class="fa fa-angle-up"></i>
    </a>

    <!-- Logout Modal -->
    <div class="modal fade" id="exampleModal" tabindex="-1" role="dialog" aria-labelledby="exampleModalLabel" aria-hidden="true">
      <div class="modal-dialog" role="document">
        <div class="modal-content">
          <div class="modal-header">
            <h5 class="modal-title" id="exampleModalLabel">Ready to Leave?</h5>
            <button type="button" class="close" data-dismiss="modal" aria-label="Close">
              <span aria-hidden="true">&times;</span>
            </button>
          </div>
          <div class="modal-body">
            Select "Logout" below if you are ready to end your current session.
          </div>
          <div class="modal-footer">
            <button type="button" class="btn btn-secondary" data-dismiss="modal">Cancel</button>
            <a class="btn btn-primary" href="login.html">Logout</a>
          </div>
        </div>
      </div>
    </div>

    <!-- Bootstrap core JavaScript -->
    <script src="{{ url_for('static', filename='default/js/jquery.min.js')}}"></script>
    <script src="{{ url_for('static', filename='default/js/popper.min.js')}}"></script>
    <script src="{{ url_for('static', filename='default/js/bootstrap.min.js')}}"></script>

    <!-- Plugin JavaScript -->
    <script src="{{ url_for('static', filename='default/js/jquery.easing.min.js')}}"></script>
    <script src="{{ url_for('static', filename='default/js/Chart.min.js')}}"></script>
    <script src="{{ url_for('static', filename='default/js/jquery.dataTables.js')}}"></script>
    <script src="{{ url_for('static', filename='default/js/dataTables.bootstrap4.js')}}"></script>

    <!-- Custom scripts for this template -->
    <script src="{{ url_for('static', filename='default/js/sb-admin.min.js')}}"></script>
  </body>

</html>
#+END_SRC

