build/docs/runtime/web/scene12.html
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Index HTML</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">HTML for the experiment</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="font-weight: bold;">!DOCTYPE</span> html&gt;
&lt;<span style="font-weight: bold;">html</span> <span style="font-weight: bold; font-style: italic;">lang</span>=<span style="font-style: italic;">"en"</span>&gt;

  &lt;<span style="font-weight: bold;">head</span>&gt;

    &lt;<span style="font-weight: bold;">meta</span> <span style="font-weight: bold; font-style: italic;">charset</span>=<span style="font-style: italic;">"utf-8"</span>&gt;
    &lt;<span style="font-weight: bold;">meta</span> <span style="font-weight: bold; font-style: italic;">http-equiv</span>=<span style="font-style: italic;">"X-UA-Compatible"</span> <span style="font-weight: bold; font-style: italic;">content</span>=<span style="font-style: italic;">"IE=edge"</span>&gt;
    &lt;<span style="font-weight: bold;">meta</span> <span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"viewport"</span> <span style="font-weight: bold; font-style: italic;">content</span>=<span style="font-style: italic;">"width=device-width, initial-scale=1, shrink-to-fit=no"</span>&gt;

    &lt;<span style="font-weight: bold;">meta</span> <span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"description"</span> <span style="font-weight: bold; font-style: italic;">content</span>=<span style="font-style: italic;">""</span>&gt;
    &lt;<span style="font-weight: bold;">meta</span> <span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"author"</span> <span style="font-weight: bold; font-style: italic;">content</span>=<span style="font-style: italic;">""</span>&gt;
    &lt;<span style="font-weight: bold;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Merge Sort</span>&lt;/<span style="font-weight: bold;">title</span>&gt;
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/d3.v3.min.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/dagre-d3.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;

    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">Bootstrap core CSS </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    &lt;<span style="font-weight: bold;">link</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/css/bootstrap.min.css')}}"</span> <span style="font-weight: bold; font-style: italic;">rel</span>=<span style="font-style: italic;">"stylesheet"</span>&gt;

    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">Plugin CSS </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    &lt;<span style="font-weight: bold;">link</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/css/dataTables.bootstrap4.css')}}"</span> <span style="font-weight: bold; font-style: italic;">rel</span>=<span style="font-style: italic;">"stylesheet"</span>&gt;
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/jquery.min.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;

    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">Custom styles for this template </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    &lt;<span style="font-weight: bold;">link</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/css/sb-admin.css')}}"</span> <span style="font-weight: bold; font-style: italic;">rel</span>=<span style="font-style: italic;">"stylesheet"</span>&gt;
    &lt;<span style="font-weight: bold;">style</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"css"</span>&gt;
      /* This sets the color for "TK" nodes to a light blue green. */
      g.type-TK &gt; rect {
        fill: #00ffd0;
      }
      h6 {
        font-size: 18px;
      }
      .hidden {
        display: none;
      }
      text {
        font-weight: 300;
        font-family: "Helvetica Neue", Helvetica, Arial, sans-serf;
        font-size: 14px;
      }
      i {
          border: solid black;
          border-width: 0 3px 3px 0;
          display: inline-block;
          padding: 3px;
      }
      .left {
        transform: rotate(135deg);
        -webkit-transform: rotate(135deg);
      }
      .down {
        transform: rotate(45deg);
        -webkit-transform: rotate(45deg);
        float:right;
      }
      input {
      display: inline-block;
      vertical-align: middle;
      margin: 10px 0;
      }
      #but1 {
      display: inline-block;
      vertical-align: middle;
      }
      #c{
      display: inline-block;
      margin-left: 400px;
      }
      #but2 {
      display: inline-block;
      vertical-align: middle;
      }

      .node rect {
        stroke: #999;
        fill: #fff;
        stroke-width: 1.5px;
      }

      .edgePath path {
        stroke: #333;
        stroke-width: 1.5px;
      }
      /*tspan{
        fill: red;
        font-weight: bold
      }*/
      div{
        z-index:1;
      }
      div.bond
      {
        position: -webkit-sticky; /* Safari */
        position: sticky;
        z-index:3;
        top: -10px;
        background-color: #C8C8C8;
      }
      .bl{
        background-color: lightblue;
      }
    &lt;/<span style="font-weight: bold;">style</span>&gt;
  &lt;/<span style="font-weight: bold;">head</span>&gt;

  &lt;<span style="font-weight: bold;">body</span> <span style="font-weight: bold; font-style: italic;">class</span>="fixed-nav sticky-footer bg-dark" <span style="font-weight: bold; font-style: italic;">id</span>="page-top"&gt;

    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">Navigation </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    &lt;<span style="font-weight: bold;">nav</span> <span style="font-weight: bold; font-style: italic;">class</span>="navbar navbar-expand-lg navbar-dark bg-dark fixed-top" <span style="font-weight: bold; font-style: italic;">id</span>="mainNav"&gt;
      &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">class</span>="navbar-brand" <span style="font-weight: bold; font-style: italic;">href</span>="#"&gt;DS-Lab&lt;/<span style="font-weight: bold;">a</span>&gt;
      &lt;<span style="font-weight: bold;">button</span> <span style="font-weight: bold; font-style: italic;">style</span>="background-color:#bfc9ca;margin-left:31px" <span style="font-weight: bold; font-style: italic;">class</span>="btn btn-success" <span style="font-weight: bold; font-style: italic;">onclick</span>="pane()"&gt;Pane&lt;/<span style="font-weight: bold;">button</span>&gt;
      &lt;<span style="font-weight: bold;">button</span> <span style="font-weight: bold; font-style: italic;">class</span>="navbar-toggler navbar-toggler-right" <span style="font-weight: bold; font-style: italic;">type</span>="button" <span style="font-weight: bold; font-style: italic;">data-toggle</span>="collapse" <span style="font-weight: bold; font-style: italic;">data-target</span>="#navbarResponsive" <span style="font-weight: bold; font-style: italic;">aria-controls</span>="navbarResponsive" <span style="font-weight: bold; font-style: italic;">aria-expanded</span>="false" <span style="font-weight: bold; font-style: italic;">aria-label</span>="Toggle navigation"&gt;
        &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>="navbar-toggler-icon"&gt;&lt;/<span style="font-weight: bold;">span</span>&gt;
      &lt;/<span style="font-weight: bold;">button</span>&gt;
      &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>="collapse navbar-collapse" <span style="font-weight: bold; font-style: italic;">id</span>="navbarResponsive"&gt;
        &lt;<span style="font-weight: bold;">ul</span> <span style="font-weight: bold; font-style: italic;">class</span>="navbar-nav navbar-sidenav" <span style="font-weight: bold; font-style: italic;">id</span>="exampleAccordion"&gt;
          &lt;<span style="font-weight: bold;">li</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-item active" <span style="font-weight: bold; font-style: italic;">data-toggle</span>="tooltip" <span style="font-weight: bold; font-style: italic;">data-placement</span>="right" <span style="font-weight: bold; font-style: italic;">title</span>="Dashboard"&gt;
            &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-link" <span style="font-weight: bold; font-style: italic;">href</span>="#"&gt;
              &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-link-text"&gt;
                Merge-Sort
              &lt;/<span style="font-weight: bold;">span</span>&gt;
            &lt;/<span style="font-weight: bold;">a</span>&gt;
          &lt;/<span style="font-weight: bold;">li</span>&gt;
          &lt;<span style="font-weight: bold;">li</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-item" <span style="font-weight: bold; font-style: italic;">data-toggle</span>="tooltip" <span style="font-weight: bold; font-style: italic;">data-placement</span>="right" <span style="font-weight: bold; font-style: italic;">title</span>="References"&gt;
            &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-link nav-link-collapse collapsed" <span style="font-weight: bold; font-style: italic;">data-toggle</span>="collapse" <span style="font-weight: bold; font-style: italic;">href</span>="#collapseComponents" <span style="font-weight: bold; font-style: italic;">data-parent</span>="#exampleAccordion"&gt;
              &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-link-text"&gt;
                References
              &lt;/<span style="font-weight: bold;">span</span>&gt;
              &lt;<span style="font-weight: bold;">i</span> <span style="font-weight: bold; font-style: italic;">class</span>="down"&gt;&lt;/<span style="font-weight: bold;">i</span>&gt;
            &lt;/<span style="font-weight: bold;">a</span>&gt;
            &lt;<span style="font-weight: bold;">ul</span> <span style="font-weight: bold; font-style: italic;">class</span>="sidenav-second-level collapse" <span style="font-weight: bold; font-style: italic;">id</span>="collapseComponents"&gt;
              &lt;<span style="font-weight: bold;">li</span>&gt;
                &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>="https://en.wikipedia.org/wiki/Merge_sort"&gt;Wiki-pedia&lt;/<span style="font-weight: bold;">a</span>&gt;
              &lt;/<span style="font-weight: bold;">li</span>&gt;
              &lt;<span style="font-weight: bold;">li</span>&gt;
                &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>="http://www.geeksforgeeks.org/merge-sort/"&gt;Geeks for Geeks&lt;/<span style="font-weight: bold;">a</span>&gt;
              &lt;/<span style="font-weight: bold;">li</span>&gt;
            &lt;/<span style="font-weight: bold;">ul</span>&gt;
          &lt;/<span style="font-weight: bold;">li</span>&gt;
          &lt;<span style="font-weight: bold;">li</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-item" <span style="font-weight: bold; font-style: italic;">data-toggle</span>="tooltip" <span style="font-weight: bold; font-style: italic;">data-placement</span>="right" <span style="font-weight: bold; font-style: italic;">title</span>="Example Pages"&gt;
            &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-link nav-link-collapse collapsed" <span style="font-weight: bold; font-style: italic;">data-toggle</span>="collapse" <span style="font-weight: bold; font-style: italic;">href</span>="#collapseExamplePages" <span style="font-weight: bold; font-style: italic;">data-parent</span>="#exampleAccordion"&gt;
            &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-link-text"&gt;
                Quizzes
            &lt;/<span style="font-weight: bold;">span</span>&gt;
            &lt;<span style="font-weight: bold;">i</span> <span style="font-weight: bold; font-style: italic;">class</span>="down"&gt;&lt;/<span style="font-weight: bold;">i</span>&gt;
            &lt;/<span style="font-weight: bold;">a</span>&gt;
            &lt;<span style="font-weight: bold;">ul</span> <span style="font-weight: bold; font-style: italic;">class</span>="sidenav-second-level collapse" <span style="font-weight: bold; font-style: italic;">id</span>="collapseExamplePages"&gt;
              &lt;<span style="font-weight: bold;">li</span>&gt;
                &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>="#"&gt;Quiz-1&lt;/<span style="font-weight: bold;">a</span>&gt;
              &lt;/<span style="font-weight: bold;">li</span>&gt;
              &lt;<span style="font-weight: bold;">li</span>&gt;
                &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>="#"&gt;Quiz-2&lt;/<span style="font-weight: bold;">a</span>&gt;
              &lt;/<span style="font-weight: bold;">li</span>&gt;
            &lt;/<span style="font-weight: bold;">ul</span>&gt;
          &lt;/<span style="font-weight: bold;">li</span>&gt;
        &lt;/<span style="font-weight: bold;">ul</span>&gt;
        &lt;<span style="font-weight: bold;">ul</span> <span style="font-weight: bold; font-style: italic;">class</span>="navbar-nav sidenav-toggler"&gt;
          &lt;<span style="font-weight: bold;">li</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-item"&gt;
            &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">class</span>="nav-link text-center" <span style="font-weight: bold; font-style: italic;">id</span>="sidenavToggler"&gt;
              &lt;<span style="font-weight: bold;">i</span> <span style="font-weight: bold; font-style: italic;">class</span>="left"&gt;&lt;/<span style="font-weight: bold;">i</span>&gt;
            &lt;/<span style="font-weight: bold;">a</span>&gt;
          &lt;/<span style="font-weight: bold;">li</span>&gt;
        &lt;/<span style="font-weight: bold;">ul</span>&gt;
        &lt;<span style="font-weight: bold;">ul</span> <span style="font-weight: bold; font-style: italic;">class</span>="navbar-nav ml-auto"&gt;
          &lt;<span style="font-weight: bold;">ul</span> <span style="font-weight: bold; font-style: italic;">class</span>="readcrumb"&gt;
            &lt;<span style="font-weight: bold;">li</span> &gt;
              &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>="#"&gt;VLEADS&lt;/<span style="font-weight: bold;">a</span>&gt;
            &lt;/<span style="font-weight: bold;">li</span>&gt;
            &lt;<span style="font-weight: bold;">li</span>&gt;
              &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>="#"&gt;DS -&gt; Merge-Sort&lt;/<span style="font-weight: bold;">a</span>&gt;
            &lt;/<span style="font-weight: bold;">li</span>&gt;
          &lt;/<span style="font-weight: bold;">ul</span>&gt;
          &lt;<span style="font-weight: bold;">li</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"nav-item"</span>&gt;
            &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"nav-link"</span> <span style="font-weight: bold; font-style: italic;">data-toggle</span>=<span style="font-style: italic;">"modal"</span> <span style="font-weight: bold; font-style: italic;">data-target</span>=<span style="font-style: italic;">"#exampleModal"</span>&gt;
              Logout
            &lt;/<span style="font-weight: bold;">a</span>&gt;
          &lt;/<span style="font-weight: bold;">li</span>&gt;
        &lt;/<span style="font-weight: bold;">ul</span>&gt;
      &lt;/<span style="font-weight: bold;">div</span>&gt;
    &lt;/<span style="font-weight: bold;">nav</span>&gt;

    &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"content-wrapper"</span>&gt;
      &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"bond"</span>&gt;
        &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"form-group"</span>&gt;
          &lt;<span style="font-weight: bold;">label</span> <span style="font-weight: bold; font-style: italic;">for</span>=<span style="font-style: italic;">"arr"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"font-size:130%"</span>&gt;Please enter the array to sort (space separated)&lt;/<span style="font-weight: bold;">label</span>&gt;
          &lt;<span style="font-weight: bold;">input</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"text"</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"arr"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"form-control"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"width:55%;font-size: 120%"</span> &gt;
          &lt;<span style="font-weight: bold;">button</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"button"</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"but1"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"display:inline;position:absolute;left:2%;background-color:#606060;"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"btn btn-success btn-lg"</span> <span style="font-weight: bold; font-style: italic;">onclick</span>=<span style="font-style: italic;">"helper()"</span>&gt;Sort&lt;/<span style="font-weight: bold;">button</span>&gt;
          &lt;<span style="font-weight: bold;">h3</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"c"</span>&gt;<span style="font-style: italic; text-decoration: underline;">Merge Sort Time Complexity Example</span>&lt;/<span style="font-weight: bold;">h3</span>&gt;
          &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>='/11' <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"btn btn-success btn-lg"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"display:inline;position:absolute;left:83%;background-color:#606060;"</span>&gt;&lt;&lt; Back&lt;/<span style="font-weight: bold;">a</span>&gt;
          &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>='/13' <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"btn btn-success btn-lg"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"display:inline;position:absolute;left:92%;background-color:#606060;"</span>&gt;Next &gt;&gt;&lt;/<span style="font-weight: bold;">a</span>&gt;
          &lt;<span style="font-weight: bold;">button</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"button"</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"but2"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"display:inline;position:absolute;left:75%;background-color:#606060;"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"btn btn-success btn-lg"</span> <span style="font-weight: bold; font-style: italic;">onclick</span>=<span style="font-style: italic;">"reset1()"</span>&gt;Reset&lt;/<span style="font-weight: bold;">button</span>&gt;
          &lt;<span style="font-weight: bold;">br</span>/&gt;&lt;<span style="font-weight: bold;">br</span>/&gt;
        &lt;/<span style="font-weight: bold;">div</span>&gt;
      &lt;/<span style="font-weight: bold;">div</span>&gt;
    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">&lt;div class="list-group" style="width:40%"&gt;</span>
<span style="font-weight: bold; font-style: italic;">      &lt;a href="#" class="list-group-item list-group-item-action  list-group-item-info"&gt;</span>
<span style="font-weight: bold; font-style: italic;">        &lt;p&gt;</span>
<span style="font-weight: bold; font-style: italic;">           Click on the node to split the node into two halves.&lt;br/&gt;</span>
<span style="font-weight: bold; font-style: italic;">           Repeat the process to see the recursive structure.</span>
<span style="font-weight: bold; font-style: italic;">        &lt;/p&gt;</span>
<span style="font-weight: bold; font-style: italic;">      &lt;/a&gt;</span>
<span style="font-weight: bold; font-style: italic;">    &lt;/div&gt; </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    &lt;<span style="font-weight: bold;">br</span>/&gt;&lt;<span style="font-weight: bold;">br</span>/&gt;
      &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"container-fluid"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"position: relative"</span>&gt;
        &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"svg-holder"</span>&gt;
        &lt;/<span style="font-weight: bold;">div</span>&gt;
        &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"card mb-3"</span>&gt;
          &lt;<span style="font-weight: bold;">svg</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"svg-canvas"</span> width=100% height=600 <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"position: absolute;left:700px;top:50px;"</span>&gt;&lt;/<span style="font-weight: bold;">svg</span>&gt;
        &lt;/<span style="font-weight: bold;">div</span>&gt;
        &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"list-group"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"width:40%"</span>&gt;
          &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"#"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"list-group-item list-group-item-action list-group-item-success"</span>&gt;
            &lt;<span style="font-weight: bold;">h5</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"color:black;font-weight: bold"</span>&gt;<span style="text-decoration: underline;">MergeSort Time Complexity Example</span>&lt;/<span style="font-weight: bold;">h5</span>&gt;
            &lt;<span style="font-weight: bold;">ul</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"color:black"</span>&gt;
              &lt;<span style="font-weight: bold;">li</span>&gt;&lt;<span style="font-weight: bold;">h6</span>&gt;<span style="text-decoration: underline;">Enter an array of max size 10 elements containing only single digits.</span>&lt;/<span style="font-weight: bold;">h6</span>&gt;&lt;/<span style="font-weight: bold;">li</span>&gt;
              &lt;<span style="font-weight: bold;">li</span>&gt;&lt;<span style="font-weight: bold;">h6</span>&gt;<span style="text-decoration: underline;">The array entered will be sorted and mergesort graph will be displayed.</span>&lt;/<span style="font-weight: bold;">h6</span>&gt;&lt;/<span style="font-weight: bold;">li</span>&gt;
              &lt;<span style="font-weight: bold;">li</span>&gt;&lt;<span style="font-weight: bold;">h6</span>&gt;<span style="text-decoration: underline;">We will manually compute the number of splits and time for merging the arrays and compare with mergesort time complexity formula. </span>&lt;/<span style="font-weight: bold;">h6</span>&gt;&lt;/<span style="font-weight: bold;">li</span>&gt;
            &lt;/<span style="font-weight: bold;">ul</span>&gt;
          &lt;/<span style="font-weight: bold;">a</span>&gt;
        &lt;/<span style="font-weight: bold;">div</span>&gt;&lt;<span style="font-weight: bold;">br</span>/&gt;&lt;<span style="font-weight: bold;">br</span>/&gt;
        &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"width:40%"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"list-group answer-holder"</span>&gt;
          &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"#"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"list-group-item list-group-item-action list-group-item-success"</span>&gt;
            &lt;<span style="font-weight: bold;">h5</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"color:black;font-weight: bold"</span>&gt;<span style="text-decoration: underline;">Computation</span>&lt;/<span style="font-weight: bold;">h5</span>&gt;
            &lt;<span style="font-weight: bold;">ul</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"color:black"</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"computation-holder"</span>&gt;
            &lt;/<span style="font-weight: bold;">ul</span>&gt;
          &lt;/<span style="font-weight: bold;">a</span>&gt;
        &lt;/<span style="font-weight: bold;">div</span>&gt;
        &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"../static/js/mergesort_example.js"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
      &lt;/<span style="font-weight: bold;">div</span>&gt;
      &lt;<span style="font-weight: bold;">br</span>/&gt;&lt;<span style="font-weight: bold;">br</span>/&gt;&lt;<span style="font-weight: bold;">br</span>/&gt;
    &lt;/<span style="font-weight: bold;">div</span>&gt;

    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">/.container-fluid </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">/.content-wrapper </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">Scroll to Top Button </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>

    &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"scroll-to-top rounded"</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"#page-top"</span>&gt;
      &lt;<span style="font-weight: bold;">i</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"fa fa-angle-up"</span>&gt;&lt;/<span style="font-weight: bold;">i</span>&gt;
    &lt;/<span style="font-weight: bold;">a</span>&gt;

    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">Logout Modal </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"modal fade"</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"exampleModal"</span> <span style="font-weight: bold; font-style: italic;">tabindex</span>=<span style="font-style: italic;">"-1"</span> <span style="font-weight: bold; font-style: italic;">role</span>=<span style="font-style: italic;">"dialog"</span> <span style="font-weight: bold; font-style: italic;">aria-labelledby</span>=<span style="font-style: italic;">"exampleModalLabel"</span> <span style="font-weight: bold; font-style: italic;">aria-hidden</span>=<span style="font-style: italic;">"true"</span>&gt;
      &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"modal-dialog"</span> <span style="font-weight: bold; font-style: italic;">role</span>=<span style="font-style: italic;">"document"</span>&gt;
        &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"modal-content"</span>&gt;
          &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"modal-header"</span>&gt;
            &lt;<span style="font-weight: bold;">h5</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"modal-title"</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"exampleModalLabel"</span>&gt;<span style="text-decoration: underline;">Ready to Leave?</span>&lt;/<span style="font-weight: bold;">h5</span>&gt;
            &lt;<span style="font-weight: bold;">button</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"button"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"close"</span> <span style="font-weight: bold; font-style: italic;">data-dismiss</span>=<span style="font-style: italic;">"modal"</span> <span style="font-weight: bold; font-style: italic;">aria-label</span>=<span style="font-style: italic;">"Close"</span>&gt;
              &lt;<span style="font-weight: bold;">span</span> <span style="font-weight: bold; font-style: italic;">aria-hidden</span>=<span style="font-style: italic;">"true"</span>&gt;<span style="font-weight: bold; font-style: italic;">&amp;times;</span>&lt;/<span style="font-weight: bold;">span</span>&gt;
            &lt;/<span style="font-weight: bold;">button</span>&gt;
          &lt;/<span style="font-weight: bold;">div</span>&gt;
          &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"modal-body"</span>&gt;
            Select <span style="font-style: italic;">"Logout"</span> below if you are ready to end your current session.
          &lt;/<span style="font-weight: bold;">div</span>&gt;
          &lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"modal-footer"</span>&gt;
            &lt;<span style="font-weight: bold;">button</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"button"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"btn btn-secondary"</span> <span style="font-weight: bold; font-style: italic;">data-dismiss</span>=<span style="font-style: italic;">"modal"</span>&gt;Cancel&lt;/<span style="font-weight: bold;">button</span>&gt;
            &lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"btn btn-primary"</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"login.html"</span>&gt;Logout&lt;/<span style="font-weight: bold;">a</span>&gt;
          &lt;/<span style="font-weight: bold;">div</span>&gt;
        &lt;/<span style="font-weight: bold;">div</span>&gt;
      &lt;/<span style="font-weight: bold;">div</span>&gt;
    &lt;/<span style="font-weight: bold;">div</span>&gt;

    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">Bootstrap core JavaScript </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/jquery.min.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/popper.min.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/bootstrap.min.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;

    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">Plugin JavaScript </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/jquery.easing.min.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/Chart.min.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/jquery.dataTables.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/dataTables.bootstrap4.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;

    <span style="font-weight: bold; font-style: italic;">&lt;!-- </span><span style="font-weight: bold; font-style: italic;">Custom scripts for this template </span><span style="font-weight: bold; font-style: italic;">--&gt;</span>
    &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"{{ url_for('static', filename='default/js/sb-admin.min.js')}}"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
  &lt;/<span style="font-weight: bold;">body</span>&gt;

&lt;/<span style="font-weight: bold;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
