build/docs/runtime/web/scene12.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">JS</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><code>reset1</code> function to reset the graph.
</li>
<li>This function is called when the reset button is pressed <code>reset1</code> function is called. It also resets the variables so that new graph can be constructed.
</li>
<li><code>reset</code> function is called before sort function so that new graph is created and all the global variables are intialised.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">reset</span>()
{
  g = <span style="font-weight: bold; text-decoration: underline;">null</span>
  g = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
  .setGraph({})
  .setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });
  ans=[]
  fin=0
  visited=[]
  mymap=<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Map</span>()
  <span style="font-weight: bold;">final</span>=[]
  split_number = 1;
  document.getElementById(<span style="font-style: italic;">'svg-canvas'</span>).innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
  ul_element.innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
  div_element.innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
  split_elements = []
  merge_elements = []
}
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">reset1</span>()
{
  g = <span style="font-weight: bold; text-decoration: underline;">null</span>
  g = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
  .setGraph({})
  .setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });
  ans=[]
  fin=0
  visited=[]
  mymap=<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Map</span>()
  <span style="font-weight: bold;">final</span>=[]
  split_number = 1;
  document.getElementById(<span style="font-style: italic;">'svg-canvas'</span>).innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
  document.getElementById(<span style="font-style: italic;">'arr'</span>).value = <span style="font-weight: bold; text-decoration: underline;">null</span>
  ul_element.innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
  div_element.innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
  split_elements = []
  merge_elements = []
}
</pre>
</div>

<ul class="org-ul">
<li><code>pane</code> function which handles the opening and closing of the top pane.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">pane function for hiding or displaying the pane</span>
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">pane</span> = <span style="font-weight: bold;">function</span>()
{
  <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">x</span> = document.getElementsByClassName(<span style="font-style: italic;">'bond'</span>);
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">it checks if the pane is hidden , and shows it if its hidden</span>
  <span style="font-weight: bold;">if</span>(x[0].style.display == <span style="font-style: italic;">"none"</span>)
  {
     x[0].style.display = <span style="font-style: italic;">"block"</span>;
  }
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">it hides the displayed pane on clicking the pane button</span>
  <span style="font-weight: bold;">else</span>
  {
    x[0].style.display = <span style="font-style: italic;">"none"</span>;
  }
};
</pre>
</div>

<ul class="org-ul">
<li><code>helper</code> function is called when array is entered to be sorted and sort button is clicked.
</li>
<li>It calls various functions including mergesort.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">helper</span>()
{
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Array to be sorted</span>
  reset();
        element.className = <span style="font-style: italic;">"list-group"</span>;
        split_number = 1;
        div_element.innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">array</span>=document.getElementById(<span style="font-style: italic;">'arr'</span>).value
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr</span>=array.trim().split(<span style="font-style: italic;">" "</span>);
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">length</span> = arr.length;
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">div</span>=mergeSort(arr,0);
        drawedge();
        draw();
        compute(length-1);
}
</pre>
</div>

<ul class="org-ul">
<li>The function <code>compute</code> is invoked from the helper function.
</li>
<li>The function <code>compute</code> calls the functions <code>computeLogn</code> and <code>computeMerge</code>.
</li>
<li><code>compute</code> is used to compute the complexities using the mergesort graph so that computed and theoretical values can be compared.
</li>
<li><code>computeLogn</code> is used to compute nlogn value for a given 'n' and populates the corresponding element with the value.
</li>
<li><code>computeMerge</code> does the merge computation manually and calculates the required number of computations theoretically using mergesort graph.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">computeLogn</span>(<span style="font-weight: bold; font-style: italic;">n</span>)
{
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">logval</span> = Math.log2(n);
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">ans</span> = n*logval;
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">"&lt;li&gt;&lt;h6&gt;We know that mergesort takes nlog&lt;sub&gt;2&lt;/sub&gt;n computations which is&lt;br/&gt; &lt;b&gt;("</span> + n.toString() + <span style="font-style: italic;">' x log&lt;sub&gt;2&lt;/sub&gt;'</span> +
                                        n.toString() + <span style="font-style: italic;">")&lt;/b&gt;&lt;br/&gt;&lt;/h6&gt;&lt;/li&gt;"</span>;
                string += <span style="font-style: italic;">"&lt;ul&gt;&lt;li&gt;&lt;b&gt;("</span> + n.toString() + <span style="font-style: italic;">' x '</span> + logval.toString() + <span style="font-style: italic;">")&lt;/b&gt; = &lt;b&gt;( "</span> + ans.toString() + <span style="font-style: italic;">" )&lt;/b&gt; = &lt;b&gt;"</span> + Math.ceil(ans).toString() + <span style="font-style: italic;">" &lt;/li&gt;"</span>;
                string += <span style="font-style: italic;">"&lt;/b&gt;&lt;br/&gt;&lt;li&gt;&lt;h5 style='color:red'&gt;Hence "</span> + Math.ceil(ans).toString() + <span style="font-style: italic;">' computations.&lt;/h5&gt;&lt;/li&gt;&lt;/ul&gt;'</span>;
        <span style="font-weight: bold;">return</span> string;
}
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">computeMerge</span>()
{
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">"&lt;li&gt;&lt;h6&gt;Merge Computation&lt;/h6&gt;&lt;/li&gt;"</span>;
        string += <span style="font-style: italic;">"&lt;ul&gt;"</span>;
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">count</span> = 0;
        <span style="font-weight: bold;">for</span>(<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; merge_elements.length; i++)
        {
                string += <span style="font-style: italic;">'&lt;li&gt;&lt;h6 style="font-weight:bold"&gt;Merging arrays ['</span>;
                string += merge_elements[i][0].toString() + <span style="font-style: italic;">'] and ['</span> + merge_elements[i][1].toString() + <span style="font-style: italic;">'] gives ['</span> + merge_elements[i][2].toString() + <span style="font-style: italic;">']'</span>;
                string += <span style="font-style: italic;">'&lt;br/&gt; =&gt; '</span> + merge_elements[i][2].length.toString() + <span style="font-style: italic;">' computations&lt;br/&gt;&lt;/li&gt;'</span>;
                count += merge_elements[i][2].length;
        }
        string += <span style="font-style: italic;">'&lt;li&gt;&lt;h5 style="color:red"&gt;Total '</span> + count.toString() + <span style="font-style: italic;">' computations.&lt;/li&gt;&lt;/ul&gt;'</span>;
        <span style="font-weight: bold;">return</span> string;
}
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">compute</span>(<span style="font-weight: bold; font-style: italic;">length</span>)
{
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">""</span>;
        string += <span style="font-style: italic;">"&lt;li&gt;&lt;h6&gt;From the graph we can observe that there are&lt;b&gt; "</span> + length.toString() + <span style="font-style: italic;">" splits&lt;/b&gt;.&lt;/h6&gt;&lt;/li&gt;"</span>;
        string += <span style="font-style: italic;">"&lt;li&gt;&lt;h6&gt;This is same as the calculated value &lt;b&gt;n-1&lt;/b&gt; for the number of splits which is &lt;b&gt;"</span> + length.toString() + <span style="font-style: italic;">"&lt;/b&gt;.&lt;/h6&gt;&lt;/li&gt;"</span>;
        string1 = computeMerge();
        string += string1;
        string1 = computeLogn(length + 1);
        string += string1;
        ul_element.innerHTML = string;
        <span style="font-weight: bold;">return</span>;
}
</pre>
</div>

<ul class="org-ul">
<li>Global definition of the final graph using d3 syntax.
</li>
<li>This section also contains some global definitions of maps and variables.
</li>
<li><code>split_number</code>, <code>div_element</code>, <code>ul_element</code> are used to populate the corresponding html tags with appropriate values.
</li>
<li><code>merge_elements</code> are used to keep track of the merged arrays to show them in computation.
</li>
<li><code>split_number</code> are used to keep track of the nodes which are splitting to get their locations in svg.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">g</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
.setGraph({})
.setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Set of global variables</span>

<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">ans</span>=[]
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">fin</span>=0
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">visited</span>=[]
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">mymap</span>=<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Map</span>()

<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Merge sort function</span>

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Global graph definition</span>

<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">g</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
.setGraph({})
.setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Set of global variables</span>
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">split_number</span>;
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">split_elements</span> = [];
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">merge_elements</span> = [];
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">div_element</span> = document.getElementById(<span style="font-style: italic;">'svg-holder'</span>);
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">ul_element</span> = document.getElementById(<span style="font-style: italic;">'computation-holder'</span>);
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">element</span> = document.getElementsByClassName(<span style="font-style: italic;">'answer-holder'</span>);
element = element[0];
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">ans</span>=[]
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">fin</span>=0
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">visited</span>=[]
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">mymap</span>=<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Map</span>()
<span style="font-weight: bold;">var</span> <span style="font-weight: bold;">final</span>=[]
</pre>
</div>

<ul class="org-ul">
<li>Main Merge sort function.Nodes are also constructed with id and data.
</li>
<li>ID is marked by the 2*i &amp; 2*i+1 rule as evident in a binary tree.
</li>
<li>Data is unsorted arrays.As total nodes are 2^n we also store this quantity for logical purposes.
</li>
<li>Also a map is made which maps Node ID to Node data(array).
</li>
<li>Basic merge function which takes in two arrays and returns merged array.
</li>
<li><code>findArrayString</code> function takes an array in and returns a string with elements of the array separated by spaces.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">mergeSort</span>(<span style="font-weight: bold; font-style: italic;">arr</span>,<span style="font-weight: bold; font-style: italic;">count</span>)
{
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">lab</span>=arr.toString();
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">""</span>;
        string = findArrayString(arr);
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Making a node in the graph for the current array string</span>
        g.setNode(count,{ label: string,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span>,labelStyle: <span style="font-style: italic;">"font-weight:bold"</span>});

        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Variable for storing maximum count of the node</span>
        fin=Math.max(fin,count)


        visited.push(count)

        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Maping which node number contains which string array</span>
        mymap[count]=lab;

    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Base case</span>
    <span style="font-weight: bold;">if</span> (arr.length &lt; 2)
    {
      <span style="font-weight: bold;">return</span> arr;
    }

        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Merge sort</span>
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">middle</span> = parseInt(arr.length / 2);
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">left</span>   = arr.slice(0, middle);
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">right</span>  = arr.slice(middle, arr.length);
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(mergeSort(left,2*count+1),mergeSort(right,2*count+2));

    <span style="font-weight: bold;">return</span> temp;

}

<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Merge function of merge sort. Standard code which has a result array and temporarily element is copied to this and finally returned</span>
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">merge</span>(<span style="font-weight: bold; font-style: italic;">left</span>, <span style="font-weight: bold; font-style: italic;">right</span>)
{
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">result</span> = [];

    <span style="font-weight: bold;">while</span> (left.length &amp;&amp; right.length) {
        <span style="font-weight: bold;">if</span> (left[0] &lt;= right[0]) {
            result.push(left.shift());
        } <span style="font-weight: bold;">else</span> {
            result.push(right.shift());
        }
    }

    <span style="font-weight: bold;">while</span> (left.length)
        result.push(left.shift());

    <span style="font-weight: bold;">while</span> (right.length)
        result.push(right.shift());

    <span style="font-weight: bold;">return</span> result;
}
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">findArrayString</span>(<span style="font-weight: bold; font-style: italic;">arr</span>)
{
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">""</span>;
        string += arr[0].toString();
        <span style="font-weight: bold;">for</span>(<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">i</span> = 1; i &lt; arr.length; i++)
        {
                string += <span style="font-style: italic;">" "</span> + arr[i].toString();
        }
        <span style="font-weight: bold;">return</span> string;
}
</pre>
</div>

<ul class="org-ul">
<li>Main function which renders the graph after we have added nodes and edges using d3 syntax.
</li>
<li>D3 is mixed with svg syntax and height,width is adjusted to suit the html.
</li>
<li>Basic d3 selectors along with dagre.js syntax.
</li>
<li><code>addSplitElements</code> function adds the split notation at locations where array is going to split.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">draw</span>()
{
        g.nodes().forEach(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">v</span>)
        {
                 <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">node</span> = g.node(v);
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Round the corners of the nodes</span>
                node.rx = node.ry = 5;
        })

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Create the renderer</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">render</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.render</span>();

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Set up an SVG group so that we can translate the final graph.</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">svg</span> = d3.select(<span style="font-style: italic;">"svg"</span>),
        svgGroup = svg.append(<span style="font-style: italic;">"g"</span>);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Run the renderer. This is what draws the final graph.</span>
        render(d3.select(<span style="font-style: italic;">"svg g"</span>), g);
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Center the graph</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">xCenterOffset</span> = (svg.attr(<span style="font-style: italic;">"width"</span>) - g.graph().width) / 2;
        svgGroup.attr(<span style="font-style: italic;">"transform"</span>, <span style="font-style: italic;">"translate("</span> + xCenterOffset + <span style="font-style: italic;">", 20)"</span>);
        svg.attr(<span style="font-style: italic;">"height"</span>, g.graph().height + 40);
        addSplitElements();
}
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">addSplitElements</span>()
{
        div_element = document.getElementById(<span style="font-style: italic;">'svg-holder'</span>);
        <span style="font-weight: bold;">for</span>(<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">i</span>=0;i&lt;split_elements.length;i++)
        {
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">""</span>;
                node = split_elements[i][0];
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">x</span> = node.x + 690;
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">y</span> = node.y + 85;
                string += <span style="font-style: italic;">'&lt;div style="position:absolute;color:red;font-weight:bold;left:'</span> + x.toString() + <span style="font-style: italic;">'px;top:'</span> + y.toString() + <span style="font-style: italic;">'px;"&gt;SPLIT-'</span> + split_elements[i][1].toString() + <span style="font-style: italic;">'&lt;/div&gt;'</span>;
                div_element.innerHTML += string;
        }
        <span style="font-weight: bold;">return</span>;
}
</pre>
</div>

<ul class="org-ul">
<li>Funtion which connects individual components.Slightly complex logic - as nodes are not uniform but distributed among levels that too some levels partially filled.Main problem is generating 1st and 2nd levels of merge part manually then we can combne them using the same logic of binary merging.
</li>
<li>Comments are there to explain particular section of the code.This function is divided into individual parts and each part is explained with a short line for better understanding.
</li>
<li>First part is to merge splitted nodes.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">drawedge</span>()
{
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">count</span>=fin+1;

        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">row</span>=parseInt((fin+2)/2);


        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Connecting nodes between split nodes.</span>
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Connecting already present nodes with their children i.e. 2*i+1 &amp; 2*i+2</span>

        <span style="font-weight: bold;">for</span>(i=0;i&lt;=fin;i++)
        {

                <span style="font-weight: bold;">if</span>(visited.indexOf(i)!=-1 &amp;&amp; visited.indexOf(2*i+1)!=-1 &amp;&amp; visited.indexOf(2*i+2)!=-1 )
                {

                        g.setEdge(i,2*i+1,{});
                        g.setEdge(i,2*i+2,{});
                        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">addSplitElement(g.node(i), split_number);</span>
                        split_elements.push([g.node(i),split_number]);
                        split_number++;
                }
  }
</pre>
</div>

<p>
-This part of the function will check and merge the last levels of the split segment using the fact that these nodes will not have any children so visited array for these will be empty.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">mid</span>=parseInt((fin)/2);

      <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Temp array will have nodes at last,2nd last and 3rd last levels which will be merged manually</span>

      <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temparray</span>=[]

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">This loop is for constructing the nodes of the first level of merge from the last level of split</span>

<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Mid is the starting index of the first element of the last row</span>

<span style="font-weight: bold;">for</span>(i=mid;i&lt;=fin;i=i+2)
{
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">If the node in present</span>

  <span style="font-weight: bold;">if</span>(visited.indexOf(i)!=-1)
  {
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[i];
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[i+1];
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">arr1 and arr2 contains both the neighboring strings obtained using map</span>


    tarr1=arr1.split(<span style="font-style: italic;">","</span>);
    tarr2=arr2.split(<span style="font-style: italic;">","</span>);

    tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
    tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})

    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">tarr1 and tarr2 contains the final two neighbouring arrays</span>


    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);

                      <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();

                      <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Str contains the array converted to commar separated strings.</span>

                      <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">syntax for making a new node with id as count and label as str</span>

                      <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Count is continued from fin i.e 2^n</span>
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">""</span>;
    string = findArrayString(temp);
    g.setNode(count,{ label: string,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span>,labelStyle: <span style="font-style: italic;">"font-weight:bold"</span>});
    mymap[count]=str;
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Made the node and mapped it to its corresponding count</span>

    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">This array will be used in the subsequent loops</span>

    temparray.push(count);

    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Made edges to this node</span>
    g.setEdge(i,count,{label:<span style="font-style: italic;">"O("</span> + arr1.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
    g.setEdge(i+1,count,{label:<span style="font-style: italic;">"O("</span> + arr2.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
    merge_elements.push([arr1.split(<span style="font-style: italic;">','</span>),arr2.split(<span style="font-style: italic;">','</span>),temp]);
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Increment the count for thr next node</span>
    count=count+1;

  }

}
</pre>
</div>

<ul class="org-ul">
<li>Similar to above one this will check for 2nd last level.
</li>
<li>This code handles 2 cases-First:When this node has no neighbour =&gt; It has to merged with already new generated merge node from last level.
</li>
<li>Second:Both the neigbours are there =&gt; Both of them have to be merged.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">        fin=mid;
        mid=(mid-1)/2;
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">curr</span>=0
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">var final=[]</span>
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">This loop sees if their is any node in the 2nd last level such that they are not merged with neighbour or have one merge less</span>

        <span style="font-weight: bold;">for</span>(i=mid;i&lt;fin;i+=2)
        {
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">If both the neighbours have not been mapped i.e. They have no children</span>

                <span style="font-weight: bold;">if</span>(mymap[2*i+1]==<span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; mymap[2*i+2]==<span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; mymap[2*i+3]==<span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; mymap[2*i+4]==<span style="font-weight: bold; text-decoration: underline;">null</span> )
                {
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[i];
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[i+1];
                        tarr1=arr1.split(<span style="font-style: italic;">""</span>);
                        tarr2=arr2.split(<span style="font-style: italic;">""</span>);
                        tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
                        tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})


                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);

                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">""</span>;
                        string = findArrayString(temp);
                        g.setNode(count,{ label: string,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span>,labelStyle: <span style="font-style: italic;">"font-weight:bold"</span>});
                        mymap[count]=str;

                        <span style="font-weight: bold;">final</span>.push(count)
                        g.setEdge(i,count,{label:<span style="font-style: italic;">"O("</span> + arr1.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
                        g.setEdge(i+1,count,{label:<span style="font-style: italic;">"O("</span> + arr2.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
                        merge_elements.push([arr1.split(<span style="font-style: italic;">','</span>),arr2.split(<span style="font-style: italic;">','</span>),temp]);
                        count=count+1;

                }
                <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">If the neignour has children and this node has to be merged with the result of its children.</span>

                <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span>(mymap[2*i+1]==<span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; mymap[2*i+2]==<span style="font-weight: bold; text-decoration: underline;">null</span>)
                {
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[i];
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[temparray[curr]];


                        tarr1=arr1.split(<span style="font-style: italic;">","</span>);
                        tarr2=arr2.split(<span style="font-style: italic;">","</span>);

                        tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
                        tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})


                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);

                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">""</span>;
                        string = findArrayString(temp);
                        g.setNode(count,{ label: string,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span>,labelStyle: <span style="font-style: italic;">"font-weight:bold"</span>});
                        mymap[count]=str;
                        <span style="font-weight: bold;">final</span>.push(count)
                        g.setEdge(i,count,{label:<span style="font-style: italic;">"O("</span> + arr1.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
                        g.setEdge(temparray[curr],count,{label:<span style="font-style: italic;">"O("</span> + arr2.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
                        merge_elements.push([arr1.split(<span style="font-style: italic;">','</span>),arr2.split(<span style="font-style: italic;">','</span>),temp]);
                        count=count+1;
                        curr=curr+1;
                }

        }
</pre>
</div>

<ul class="org-ul">
<li>This will merge temparray nodes one by one and add them to final array which will then be merged using binary logic.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">  <span style="font-weight: bold;">for</span>(i=curr;i&lt;temparray.length;i+=2)
  {
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[temparray[i]];
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[temparray[i+1]];


        tarr1=arr1.split(<span style="font-style: italic;">","</span>);
        tarr2=arr2.split(<span style="font-style: italic;">","</span>);


        tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
        tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})



        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);

               <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">""</span>;
        string = findArrayString(temp);
        g.setNode(count,{ label: string,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span>,labelStyle: <span style="font-style: italic;">"font-weight:bold"</span>});
        mymap[count]=str;
        <span style="font-weight: bold;">final</span>.push(count)
        g.setEdge(temparray[i],count,{label:<span style="font-style: italic;">"O("</span> + arr1.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
        g.setEdge(temparray[i+1],count,{label:<span style="font-style: italic;">"O("</span> + arr2.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
        merge_elements.push([arr1.split(<span style="font-style: italic;">','</span>),arr2.split(<span style="font-style: italic;">','</span>),temp]);
        count=count+1;
  }
</pre>
</div>

<ul class="org-ul">
<li>Final part which will merge the nodes using binary logic and stops when final array is empty.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">  <span style="font-weight: bold;">while</span>(1)
  {
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[<span style="font-weight: bold;">final</span>[0]];
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[<span style="font-weight: bold;">final</span>[1]];
    console.log(arr1, arr2);

                <span style="font-weight: bold;">if</span>(arr2 == <span style="font-weight: bold; text-decoration: underline;">null</span>)<span style="font-weight: bold;">break</span>;

                tarr1=arr1.split(<span style="font-style: italic;">","</span>);
    tarr2=arr2.split(<span style="font-style: italic;">","</span>);

    tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
    tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})

                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();
      <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">string</span> = <span style="font-style: italic;">""</span>;
      string = findArrayString(temp);
                g.setNode(count,{ label: string,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span>,labelStyle: <span style="font-style: italic;">"font-weight:bold"</span>});
    mymap[count]=str;
    <span style="font-weight: bold;">final</span>.push(count)
    g.setEdge(<span style="font-weight: bold;">final</span>[0],count,{label:<span style="font-style: italic;">"O("</span> + arr1.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
    g.setEdge(<span style="font-weight: bold;">final</span>[1],count,{label:<span style="font-style: italic;">"O("</span> + arr2.split(<span style="font-style: italic;">','</span>).length.toString() + <span style="font-style: italic;">")"</span>,labelStyle:<span style="font-style: italic;">"fill:blue;font-weight:bold"</span>});
    merge_elements.push([arr1.split(<span style="font-style: italic;">','</span>),arr2.split(<span style="font-style: italic;">','</span>),temp]);
                count=count+1;
    <span style="font-weight: bold;">final</span>.splice(0,1);

    <span style="font-weight: bold;">final</span>.splice(0,1);


    <span style="font-weight: bold;">if</span>(<span style="font-weight: bold;">final</span>.length&lt;=1)<span style="font-weight: bold;">break</span>;

  }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-12-18 MON]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2019-04-09 Tue 14:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
